УТ_для_edt/src/Documents/ЗаказНаСборку/ЗаказНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаСборку</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.смартЗаявкаНаРемонтныеРаботы</basedOn>
  <basedOn>Document.смартЗаявкаНаРазборкуОборудования</basedOn>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.смартОборудованиеКРазборке</registerRecords>
  <registerRecords>AccumulationRegister.смартГрафикОтгрузкиТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.смартСвободныеОстаткиОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ГрафикОтгрузкиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаСборку</registerRecords>
  <registerRecords>AccumulationRegister.ОбеспечениеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.смартГрафикПоступленияТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеТоваров</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.смартТоварыКОтгрузкеОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ГрафикПоступленияТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.смартЗаявкаНаГарантийныйРемонт</types>
      <types>DocumentRef.смартЗаявкаНаРемонтныеРаботы</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВнутреннихЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоСборкиРазборки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеСборкиРазборки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьСборкиРазборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантКомплектации</name>
    <type>
      <types>CatalogRef.ВариантыКомплектацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>CatalogRef.СделкиСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУказанияСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТовары</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбеспечения</name>
    <type>
      <types>EnumRef.ВариантыОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковокОтменено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОтменено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СборкаПодДеятельность</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбосабливатьПоНазначениюЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПриемкиТоваров</name>
    <type>
      <types>EnumRef.ВариантыПриемкиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЗапчастиГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УказыватьСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>смартИзьятие</name>
      <comment>//++ #1646 смарт: Мосолов 20.02.2024 // Контроль разобранного оборудования и снятых запчастей</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>смартИсходнаяНоменклатура</name>
      <comment>//++ #1646 смарт: Мосолов 20.02.2024 // Контроль разобранного оборудования и снятых запчастей</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>смартИсходнаяХарактеристика</name>
      <comment>//++ #1646 смарт: Мосолов 20.02.2024 // Контроль разобранного оборудования и снятых запчастей</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>смартЗапчастиГарантийные</name>
      <comment>//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУказыватьСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Documents/ЗаказНаСборку/Forms/смартВыгрузкаВАтлант/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Документ", Документ);
	ЗаполнитьТоварыПоДокументу();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытияЭлементов

&НаСервере
Функция СформироватьИОтправитьНаСервере()
	
	Результат = Новый Структура("Параметры,Файлы", Новый Структура, Новый Массив);
	Результат.Параметры.Вставить("ПапкаВыгрузкиОтгрузка", смартИнтеграцияАтлант.ПолучитьПапкуВыгрузкиДляДокумента(Документ, 1));
	Результат.Параметры.Вставить("ПапкаВыгрузкиПриемка", смартИнтеграцияАтлант.ПолучитьПапкуВыгрузкиДляДокумента(Документ, 2));
	
	//1. Документы на отгрузку
	Шапка = смартИнтеграцияАтлант.ПолучитьСтруктуруПараметровШапкиАтлант();
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		
		Шапка.Номер = СтрШаблон("КОМ-%1", смартИнтеграцияАтлант.НомерНаПечать(Документ.Номер, Истина, Истина));
		Шапка.ДатаОтгрузки = ТекущаяДатаСеанса();
		Шапка.Менеджер = Пользователи.АвторизованныйПользователь();
		
	КонецЕсли;
	
	Уведомление = смартИнтеграцияАтлант.СформироватьУведомлениеОбОтгрузкеАтлант(Шапка, ТоварыОтгрузка.Выгрузить(), УникальныйИдентификатор);
	ИмяФайла = смартИнтеграцияАтлант.ПолучитьИмяФайлаПоДокументу(Документ, 1, "xls");
	Результат.Файлы.Добавить(Новый Структура("ИмяФайла,Данные,Направление,ВыгружатьНаFTP,ОтправлятьПоПочте,Расширение", ИмяФайла, Уведомление, 1, Ложь, Истина, "xls"));
	
	ФайлXML = смартИнтеграцияАтлант.СформироватьXMLФайлОтгрузки(Шапка, ТоварыОтгрузка.Выгрузить(), УникальныйИдентификатор);
	ИмяФайла = смартИнтеграцияАтлант.ПолучитьИмяФайлаПоДокументу(Документ, 1, "xml");
	Результат.Файлы.Добавить(Новый Структура("ИмяФайла,Данные,Направление,ВыгружатьНаFTP,ОтправлятьПоПочте,Расширение", ИмяФайла, ФайлXML, 1, Истина, Истина, "xml"));
	
	//2. Документы на приемку
	Шапка = смартИнтеграцияАтлант.ПолучитьСтруктуруПараметровШапкиАтлант();
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		
		Шапка.Номер = СтрШаблон("КОМ-%1", смартИнтеграцияАтлант.НомерНаПечать(Документ.Номер, Истина, Истина));
		Шапка.ДатаОтгрузки = ТекущаяДатаСеанса();
		Шапка.Менеджер = Пользователи.АвторизованныйПользователь();
		
	КонецЕсли;
	
	Уведомление = смартИнтеграцияАтлант.СформироватьУведомлениеОПриемкеАтлант(Шапка, ТоварыПриемка.Выгрузить(), УникальныйИдентификатор);
	ИмяФайла = смартИнтеграцияАтлант.ПолучитьИмяФайлаПоДокументу(Документ, 2, "xls");
	Результат.Файлы.Добавить(Новый Структура("ИмяФайла,Данные,Направление,ВыгружатьНаFTP,ОтправлятьПоПочте,Расширение", ИмяФайла, Уведомление, 2, Ложь, Истина, "xls"));
	
	ФайлXML = смартИнтеграцияАтлант.СформироватьXMLФайлПриемки(Шапка, ТоварыПриемка.Выгрузить(), УникальныйИдентификатор);
	ИмяФайла = смартИнтеграцияАтлант.ПолучитьИмяФайлаПоДокументу(Документ, 2, "xml");
	Результат.Файлы.Добавить(Новый Структура("ИмяФайла,Данные,Направление,ВыгружатьНаFTP,ОтправлятьПоПочте,Расширение", ИмяФайла, ФайлXML, 2, Истина, Истина, "xml"));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СформироватьИОтправить(Команда)
	
	Результат = СформироватьИОтправитьНаСервере();
	ОтправитьПакетДокументовНаПочтуАтлант(Результат.Файлы);
	ВыгрузитьСформированныеДокументыНаFTP(Результат.Файлы);
	ЗаписатьФайлыНаДиск(Результат);
	ВыгрузитьНоменклатуруПоДокументамНаFTP();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ВыгрузитьНоменклатуруПоДокументамНаFTP()
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивНоменклатуры = ТоварыОтгрузка.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивНоменклатуры, ТоварыПриемка.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура"));
	
	смартИнтеграцияАтлант.ВыгрузитьМассивНоменклатурыНаFTP(МассивНоменклатуры, Документ.Склад.смартНастройкаОбменомСАтлант);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФайлыНаДиск(Данные)
	
	Для Каждого стрФайл Из Данные.Файлы Цикл
		
		Если стрФайл.Направление = 1 Тогда
			КаталогДляСохранения = Данные.Параметры.ПапкаВыгрузкиОтгрузка;
		Иначе
			КаталогДляСохранения = Данные.Параметры.ПапкаВыгрузкиПриемка;
		КонецЕсли;
		
		СоздатьКаталог(КаталогДляСохранения);
		
		ПолноеИмяФайла = СтрШаблон("%1\%2", КаталогДляСохранения, стрФайл.ИмяФайла);
		
		Попытка
			
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(стрФайл.Данные);
			ДвоичныеДанныеФайла.Записать(ПолноеИмяФайла);

			ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл : " + ПолноеИмяФайла);
			
		Исключение
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось сохранить файл : " + ПолноеИмяФайла + Символы.ПС + ОписаниеОшибки());
			Продолжить;
			
		КонецПопытки;
		
	КонецЦикла;				

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьСформированныеДокументыНаFTP(Файлы)
	
	Соединение = смартИнтеграцияАтлант.ПолучитьFTPСоединение(Документ.Склад.смартНастройкаОбменомСАтлант);
	Если Соединение = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось установить FTP соединение с сервером Атлант");
		Возврат;
	КонецЕсли;
	
	Для каждого стрФайл Из Файлы Цикл
		
		Если НЕ стрФайл.ВыгружатьНаFTP Тогда
			Продолжить;
		КонецЕсли;
		
		Если Б_ОбменССайтомСервер.смарт_ЭтоКопияБазы() Тогда
			Если стрФайл.Направление = 1 Тогда
				ПутьНаФТП = "OUT1";
			Иначе
				ПутьНаФТП = "IN1";
			КонецЕсли;
		Иначе
			Если стрФайл.Направление = 1 Тогда
				ПутьНаФТП = "OUT";
			Иначе
				ПутьНаФТП = "IN";
			КонецЕсли;
		КонецЕсли;
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(стрФайл.Расширение);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(стрФайл.Данные);
		Двоичныеданные.Записать(ИмяВременногоФайла);
		
		Если НЕ	смартИнтеграцияАтлант.ЗаписатьФайлВКаталог(Соединение, ПутьНаФТП, ИмяВременногоФайла, стрФайл.ИмяФайла) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось установить выгрузить файл %1 на FTP", стрФайл.ИмяФайла));
		КонецЕсли;
		
		УдалитьФайлы(ИмяВременногоФайла);
		
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю("Данные выгружены на FTP!");
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПакетДокументовНаПочтуАтлант(Файлы)
	
	Вложения = Новый Массив;
	
	Для Каждого стрФайл Из Файлы Цикл
		
		Если НЕ стрФайл.ОтправлятьПоПочте Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеВложения = Новый Структура();
		ДанныеВложения.Вставить("Представление", стрФайл.ИмяФайла);
		ДанныеВложения.Вставить("АдресВоВременномХранилище", стрФайл.Данные);
		
		Вложения.Добавить(ДанныеВложения);
		
	КонецЦикла;
	
	Получатели = Новый Массив;
	Для каждого стрПолучатель Из Документ.Склад.смартАдресаДляОтправкиПакетаНаСклад Цикл
		
		Получатель = Новый Структура("Адрес,Представление", стрПолучатель.смартАдресДляОтправкиПакетаНаСклад, стрПолучатель.смартАдресДляОтправкиПакетаНаСклад);
		Получатели.Добавить(Получатель);
		
	КонецЦикла;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", Получатели);
	ПараметрыПисьма.Вставить("ПолучателиСообщения", Получатели);
	ПараметрыПисьма.Вставить("Тема", СтрШаблон("Пакет документов по %1", Документ));
	ПараметрыПисьма.Вставить("Тело", "");
	
	ПараметрыПисьма.Вставить("Вложения", Вложения);
			
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыПисьма);
	РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗапись, Письмо);
	
	ОбщегоНазначения.СообщитьПользователю("Письма отправлены !");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоДокументу()
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
		ЗаполнитьДанныеПоЗаказуНаСборку();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоЗаказуНаСборку()
	
	СборкаТоваров = НайтиСборкуТоваровПоЗаказуНаСборку(Документ);
	Если НЕ ЗначениеЗаполнено(СборкаТоваров) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("По заказу %1 не найдена сборка товаров. Без сборки выгрузка в Атлант невозможна !", Документ));
		Возврат;
	КонецЕсли;
	
	Если Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров Тогда
		
		НоваяСтрока = ТоварыПриемка.Добавить();
		НоваяСтрока.Номенклатура = СборкаТоваров.Номенклатура;
		НоваяСтрока.Характеристика = СборкаТоваров.Характеристика;
		НоваяСтрока.Серия = СборкаТоваров.Серия;
		НоваяСтрока.Количество = СборкаТоваров.Количество;
		
		ТоварыОтгрузка.Загрузить(СборкаТоваров.Товары.Выгрузить(, "Номенклатура,Характеристика,Серия,Количество"));
		
	Иначе
		
		НоваяСтрока = ТоварыОтгрузка.Добавить();
		НоваяСтрока.Номенклатура = СборкаТоваров.Номенклатура;
		НоваяСтрока.Характеристика = СборкаТоваров.Характеристика;
		НоваяСтрока.Серия = СборкаТоваров.Серия;
		НоваяСтрока.Количество = СборкаТоваров.Количество;
		
		ТоварыПриемка.Загрузить(СборкаТоваров.Товары.Выгрузить(, "Номенклатура,Характеристика,Серия,Количество"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиСборкуТоваровПоЗаказуНаСборку(ЗаказНаСборку)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СборкаТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваров
	|ГДЕ
	|	СборкаТоваров.ЗаказНаСборку = &ЗаказНаСборку
	|	И СборкаТоваров.Проведен";
	
	Запрос.УстановитьПараметр("ЗаказНаСборку", ЗаказНаСборку);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Ссылка <> NULL Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
